# Dataframe

In [2]:
import pandas as pd
import numpy as np

In [3]:
noms=['Ali','Sonia','Rahma','Saleh','Walid']
employes=np.array([[800.5,25],[1500.65,40],[1800.77,43],[2100.566,32],[1400.56,51]])

In [9]:
df_employees = pd.DataFrame(employes, index=noms, columns=['Salaire','Age'])

In [10]:
df_employees

        Salaire   Age
Ali     800.500  25.0
Sonia  1500.650  40.0
Rahma  1800.770  43.0
Saleh  2100.566  32.0
Walid  1400.560  51.0

In [11]:
df_employees['Sivil Status']=['Married','Single','Married','Single','Married']

In [12]:
df_employees

        Salaire   Age Sivil Status
Ali     800.500  25.0      Married
Sonia  1500.650  40.0       Single
Rahma  1800.770  43.0      Married
Saleh  2100.566  32.0       Single
Walid  1400.560  51.0      Married

In [19]:
import datetime as dt
df_employees['Birthyear']= dt.datetime.now().year - df_employees['Age']

In [17]:
df_employees['Birthyear']= [ 2022-i for i in df_employees.Age]

In [20]:
df_employees

        Salaire   Age Sivil Status  Birthyear
Ali     800.500  25.0      Married     1997.0
Sonia  1500.650  40.0       Single     1982.0
Rahma  1800.770  43.0      Married     1979.0
Saleh  2100.566  32.0       Single     1990.0
Walid  1400.560  51.0      Married     1971.0

In [ ]:
df_employees.drop('Age', axis=1, inplace=True, errors='ignore')